app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.user = current_user

    if @comment.save
---
INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "testing to see if the commenting is working"], ["user_id", 1], ["post_id", 1], ["created_at", "2017-07-22 12:00:10.221023"], ["updated_at", "2017-07-22 12:00:10.221023"]]