app/controllers/notifications_controller.rb

  def index
    @notifications = Notification.all
---
SELECT "notifications".* FROM "notifications"

  def create
    @notification = Notification.new(notification_params)

    if @notification.save
---
INSERT INTO "notifications" ("read", "comment_id", "receiver_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["read", "f"], ["comment_id", 1], ["receiver_id", 2], ["created_at", "2017-07-22 12:06:19.233572"], ["updated_at", "2017-07-22 12:06:19.233572"]]