app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "testing2"], ["body", "lnskjnsdkjnsdfnksdnf"], ["user_id", 1], ["created_at", "2017-07-22 12:02:16.327656"], ["updated_at", "2017-07-22 12:02:16.327656"]]
---
  def create
    @post = Post.new(Uploader.upload(post_params))
    @post.user = current_user

    if @post.save

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]
---
  def destroy
    return render json: { errors: ["Unauthorized"] } if @post.user != current_user
    @post.destroy